docs/1c-export-2026-06-02/Reports/АнализПродажПоКлиентам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Report>
		<Properties>
			<Name>АнализПродажПоКлиентам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

docs/1c-export-2026-06-02/Reports/АнализПродажПоКлиентам/Ext/ObjectModule.bsl
Перем НП Экспорт;
Перем СхемаКомпоновки Экспорт;
Перем мИменаМесяцев Экспорт;
Перем КодЯзыкаПечать Экспорт;


Процедура ПечатьРазделаОтчета(СхемаКомпоновкиДанных,Шапка) Экспорт 
	
	//Очищаем поле табличного документа
	ФормаОтчета = ЭтотОбъект.ПолучитьФорму("ФормаОтчета");
	Результат = ФормаОтчета.ЭлементыФормы.Результат;
	Результат.Очистить();
	
	Макет = ПолучитьМакет(Шапка);
	
	ОбластьШапки = Макет.ПолучитьОбласть("Шапка");

	ОбластьШапки.Параметры.Организация = СокрЛП(Организация.НаименованиеПолное);	
	//ОбластьШапки.Параметры.Подразделение = СокрЛП(Подразделение.ПолноеНаименование());
	//ОбластьШапки.Параметры.Директор = СокрЛП(Директор);
	ПериодОтчета = ПолучитьпериодОтчета();
	ОбластьШапки.Параметры.Период = ПериодОтчета;
	//
	Результат.Вывести(ОбластьШапки);
	//
	//ОбластьШапки = Макет.ПолучитьОбласть("Счета");
	//Если СхемаКомпоновки = "ТитульнаяСтраница" Тогда
		//МассивСчетов = СписокСчетов.ВыгрузитьЗначения();
		//Для Каждого Элемент Из МассивСчетов Цикл
		//		ОбластьШапки.Параметры.Счет = Элемент.Код+" - "+Элемент.Наименование;
		//		Результат.Вывести(ОбластьШапки);
		//КонецЦикла;	
	ОбластьШапки = Макет.ПолучитьОбласть("Пробел");	
	Результат.Вывести(ОбластьШапки);
	//КонецЕсли;	
	
	//Настройки по умолчанию из схемы
	Настройки = КомпоновщикНастроек.Настройки;
	
	//Не выводить заголовок
	ЗначениеЗаголовка = СхемаКомпоновкиДанных.НастройкиПоУмолчанию.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Title"));
	ЗначениеЗаголовка.Использование = Ложь;
	
	//Не выводить параметры
	ВыводПараметров = Настройки.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("DataParametersOutput"));
	ВыводПараметров.Использование = Истина;
	ВыводПараметров.Значение = ТипВыводаТекстаКомпоновкиДанных.НеВыводить;
	
	//Не выводить отбор
	ВыводФильтра = СхемаКомпоновкиДанных.НастройкиПоУмолчанию.ПараметрыВывода.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("FilterOutput"));
	ВыводФильтра.Использование = Истина;
	ВыводФильтра.Значение = ТипВыводаТекстаКомпоновкиДанных.НеВыводить;

	//Настройки по умолчанию из схемы
	Настройки = КомпоновщикНастроек.Настройки;
	Параметры = Настройки.ПараметрыДанных.Элементы;
	Параметры[0].Значение = Организация;
	Параметры[1].Значение = НачалоПериода;
	Параметры[2].Значение = КонецДня(КонецПериода);
	
	//Отбор = СхемаКомпоновкиДанных.НастройкиПоУмолчанию.Отбор;
	//Отбор = Настройки.Отбор;
	//Отбор.Элементы[0].ПравоеЗначение = 2;
	//Отбор.Элементы[1].ПравоеЗначение = 2;
	//Отбор.Элементы[2].ПравоеЗначение = 2;
	//Отбор.Элементы[3].ПравоеЗначение = 2;
	
	//Данные о расшифровке данных в переменную
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;

	//Формируем макет, с помощью компоновщика макета
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;

	//Передаем в макет компоновки схему, настройки и данные расшифровки
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных,
	Настройки, ДанныеРасшифровки);

	//Выполним компоновку с помощью процессора компоновки
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,,
	ДанныеРасшифровки);

 	//Выводим результат в табличный документ
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	
	ПроцессорВывода.УстановитьДокумент(Результат);

	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);				
	
	ТекОбласть = Результат.НайтиТекст("Разом", ТекОбласть, Результат.Область(), Истина, Истина, Истина, Ложь);

	Если ТекОбласть <> Неопределено Тогда
		ТекОбласть.Текст = НСтр("ru='Всего';uk='Всього'",КодЯзыкаПечать);
	КонецЕсли;	
	
	ТекОбласть = Результат.НайтиТекст("Разом", ТекОбласть, Результат.Область(), Истина, Истина, Истина, Ложь);

	Если ТекОбласть <> Неопределено Тогда
		ТекОбласть.Текст = НСтр("ru='Остаток на конец';uk='Залишок на кінець'",КодЯзыкаПечать);
	КонецЕсли;		
	
КонецПроцедуры	

//Служебные процедуры и функции

//Период для шапок отчетов
Функция ПолучитьпериодОтчета()Экспорт 
	
	ПериодОтчета = "";
	
	Если Год(НачалоПериода) = Год(КонецПериода) И Месяц(НачалоПериода) = Месяц(КонецПериода) Тогда // период месяц
		ПериодОтчета = мИменаМесяцев.Получить(Месяц(КонецПериода))+" "+Строка(Формат(Год(КонецПериода),"ЧГ="))+" року.";
	Иначе // произвольный период	
		ПериодОтчета = НСтр("ru='период с ';uk='період з '",КодЯзыкаПечать) + Формат(НачалоПериода,"ДЛФ=Д") + " по " + Формат(КонецПериода,"ДЛФ=Д");
	КонецЕсли;	
	
	Возврат ПериодОтчета;
	
КонецФункции
